---
--- @author zsh in 2022/9/3 14:10
---

-- ADP: The Acyclic Dependencies Principle，非循环依赖原则
-- 本模块为公用模块，暂时用来解决其他模块的循环引用问题！

-- 设置模块独占环境
_ENV = { _G = _G };
_G.setmetatable(_ENV, { __index = function(_, k)
    return _G.rawget(_G, k);
end });

-- 导入部分
-- 千万不能有其他依赖！公共模块应该绝对"高内聚低耦合"！

-- 模块初始化
local ADP = {};
local self = ADP;





-------------------------------------------------------------------------------------------------
-- [[ 弃用 ]]
-------------------------------------------------------------------------------------------------


return ADP;
 